```
krishna@turbotindias-MacBook-Pro gcp_check_regions % terraform apply
var.turbot_profile
  Enter profile matching your turbot cli credentials.

  Enter a value: punisher


An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # turbot_policy_setting.gcp_project_approved_regions will be created
  + resource "turbot_policy_setting" "gcp_project_approved_regions" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp#/policy/types/approvedRegionsDefault"
      + value                        = <<~EOT
            # - asia-east1
            # - asia-east2
            # - asia-northeast1
            # - asia-northeast2
            # - asia-northeast3
            # - asia-south1
            # - asia-southeast1
            # - australia-southeast1
            # - europe-north1
            # - europe-west1
            # - europe-west2
            # - europe-west3
            # - europe-west4
            # - europe-west6
            # - northamerica-northeast1
            # - southamerica-east1
              - us-central1
              - us-east1
              - us-east4
              - us-west1
              - us-west2
              - us-west3
            # - asia
            # - eu
            # - eur3
            # - eur4
            # - nam-eur-asia1
            # - nam3
            # - nam4
            # - nam5
            # - nam6
              - us
              - global
        EOT
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_approved_regions_policies["gcp-bigtable-cluster"] will be created
  + resource "turbot_policy_setting" "set_resource_approved_regions_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-bigtable#/policy/types/clusterApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_approved_regions_policies["gcp-composer-environment"] will be created
  + resource "turbot_policy_setting" "set_resource_approved_regions_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-composer#/policy/types/environmentApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_approved_regions_policies["gcp-computeengine-disk"] will be created
  + resource "turbot_policy_setting" "set_resource_approved_regions_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-computeengine#/policy/types/diskApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_approved_regions_policies["gcp-computeengine-instance"] will be created
  + resource "turbot_policy_setting" "set_resource_approved_regions_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-computeengine#/policy/types/instanceApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_approved_regions_policies["gcp-computeengine-node-group"] will be created
  + resource "turbot_policy_setting" "set_resource_approved_regions_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-computeengine#/policy/types/nodeGroupApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_approved_regions_policies["gcp-computeengine-node-template"] will be created
  + resource "turbot_policy_setting" "set_resource_approved_regions_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-computeengine#/policy/types/nodeTemplateApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_approved_regions_policies["gcp-computeengine-region-disk"] will be created
  + resource "turbot_policy_setting" "set_resource_approved_regions_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-computeengine#/policy/types/regionDiskApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_approved_regions_policies["gcp-computeengine-region-health-check"] will be created
  + resource "turbot_policy_setting" "set_resource_approved_regions_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-computeengine#/policy/types/regionHealthCheckApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_approved_regions_policies["gcp-dataflow-job"] will be created
  + resource "turbot_policy_setting" "set_resource_approved_regions_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-dataflow#/policy/types/jobApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_approved_regions_policies["gcp-dataproc-cluster"] will be created
  + resource "turbot_policy_setting" "set_resource_approved_regions_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-dataproc#/policy/types/clusterApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_approved_regions_policies["gcp-dataproc-job"] will be created
  + resource "turbot_policy_setting" "set_resource_approved_regions_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-dataproc#/policy/types/jobApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_approved_regions_policies["gcp-dataproc-workflowtemplate"] will be created
  + resource "turbot_policy_setting" "set_resource_approved_regions_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-dataproc#/policy/types/workflowTemplateApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_approved_regions_policies["gcp-functions-function"] will be created
  + resource "turbot_policy_setting" "set_resource_approved_regions_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-functions#/policy/types/functionApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_approved_regions_policies["gcp-kms-cryptokey"] will be created
  + resource "turbot_policy_setting" "set_resource_approved_regions_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-kms#/policy/types/cryptoKeyApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_approved_regions_policies["gcp-kubernetesengine-region-cluster"] will be created
  + resource "turbot_policy_setting" "set_resource_approved_regions_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-kubernetesengine#/policy/types/regionClusterApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_approved_regions_policies["gcp-kubernetesengine-region-node-pool"] will be created
  + resource "turbot_policy_setting" "set_resource_approved_regions_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-kubernetesengine#/policy/types/regionNodePoolApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_approved_regions_policies["gcp-kubernetesengine-zone-cluster"] will be created
  + resource "turbot_policy_setting" "set_resource_approved_regions_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-kubernetesengine#/policy/types/zoneClusterApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_approved_regions_policies["gcp-kubernetesengine-zone-node-pool"] will be created
  + resource "turbot_policy_setting" "set_resource_approved_regions_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-kubernetesengine#/policy/types/zoneNodePoolApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_approved_regions_policies["gcp-network-address"] will be created
  + resource "turbot_policy_setting" "set_resource_approved_regions_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-network#/policy/types/addressApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_approved_regions_policies["gcp-network-forwarding-rule"] will be created
  + resource "turbot_policy_setting" "set_resource_approved_regions_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-network#/policy/types/forwardingRuleApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_approved_regions_policies["gcp-network-region-backend-service"] will be created
  + resource "turbot_policy_setting" "set_resource_approved_regions_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-network#/policy/types/regionBackendServiceApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_approved_regions_policies["gcp-network-region-url-map"] will be created
  + resource "turbot_policy_setting" "set_resource_approved_regions_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-network#/policy/types/regionUrlMapApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_approved_regions_policies["gcp-network-router"] will be created
  + resource "turbot_policy_setting" "set_resource_approved_regions_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-network#/policy/types/routerApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_approved_regions_policies["gcp-network-subnetwork"] will be created
  + resource "turbot_policy_setting" "set_resource_approved_regions_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-network#/policy/types/subnetworkApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_approved_regions_policies["gcp-network-target-pool"] will be created
  + resource "turbot_policy_setting" "set_resource_approved_regions_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-network#/policy/types/targetPoolApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_approved_regions_policies["gcp-network-target-vpn-gateway"] will be created
  + resource "turbot_policy_setting" "set_resource_approved_regions_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-network#/policy/types/targetVpnGatewayApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_approved_regions_policies["gcp-network-vpn-tunnel"] will be created
  + resource "turbot_policy_setting" "set_resource_approved_regions_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-network#/policy/types/vpnTunnelApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_approved_regions_policies["gcp-scheduler-job"] will be created
  + resource "turbot_policy_setting" "set_resource_approved_regions_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-scheduler#/policy/types/jobApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_approved_regions_policies["gcp-spanner-instance"] will be created
  + resource "turbot_policy_setting" "set_resource_approved_regions_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-spanner#/policy/types/instanceApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_approved_regions_policies["gcp-sql-backup"] will be created
  + resource "turbot_policy_setting" "set_resource_approved_regions_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-sql#/policy/types/backupApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_approved_regions_policies["gcp-sql-database"] will be created
  + resource "turbot_policy_setting" "set_resource_approved_regions_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-sql#/policy/types/databaseApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_approved_regions_policies["gcp-sql-instance"] will be created
  + resource "turbot_policy_setting" "set_resource_approved_regions_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-sql#/policy/types/instanceApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_approved_regions_policies["gcp-storage-bucket"] will be created
  + resource "turbot_policy_setting" "set_resource_approved_regions_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-storage#/policy/types/bucketApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_smart_folder.gcp_regions will be created
  + resource "turbot_smart_folder" "gcp_regions" {
      + description = "Defines sets of policies for the GCP Check Regions baseline"
      + id          = (known after apply)
      + parent      = "tmod:@turbot/turbot#/"
      + parent_akas = (known after apply)
      + title       = "GCP Check Regions Policies"
    }

Plan: 35 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

turbot_smart_folder.gcp_regions: Creating...
turbot_smart_folder.gcp_regions: Creation complete after 2s [id=216723255830419]
turbot_policy_setting.set_resource_approved_regions_policies["gcp-network-vpn-tunnel"]: Creating...
turbot_policy_setting.set_resource_approved_regions_policies["gcp-computeengine-node-group"]: Creating...
turbot_policy_setting.set_resource_approved_regions_policies["gcp-kubernetesengine-zone-node-pool"]: Creating...
turbot_policy_setting.set_resource_approved_regions_policies["gcp-network-address"]: Creating...
turbot_policy_setting.set_resource_approved_regions_policies["gcp-network-target-pool"]: Creating...
turbot_policy_setting.set_resource_approved_regions_policies["gcp-dataproc-job"]: Creating...
turbot_policy_setting.set_resource_approved_regions_policies["gcp-network-forwarding-rule"]: Creating...
turbot_policy_setting.set_resource_approved_regions_policies["gcp-dataproc-workflowtemplate"]: Creating...
turbot_policy_setting.set_resource_approved_regions_policies["gcp-computeengine-region-disk"]: Creating...
turbot_policy_setting.set_resource_approved_regions_policies["gcp-spanner-instance"]: Creating...
turbot_policy_setting.set_resource_approved_regions_policies["gcp-computeengine-node-group"]: Creation complete after 4s [id=216723260644254]
turbot_policy_setting.set_resource_approved_regions_policies["gcp-spanner-instance"]: Creation complete after 4s [id=216723260662697]
turbot_policy_setting.set_resource_approved_regions_policies["gcp-network-forwarding-rule"]: Creation complete after 4s [id=216723260644255]
turbot_policy_setting.set_resource_approved_regions_policies["gcp-network-router"]: Creating...
turbot_policy_setting.set_resource_approved_regions_policies["gcp-scheduler-job"]: Creating...
turbot_policy_setting.set_resource_approved_regions_policies["gcp-computeengine-region-health-check"]: Creating...
turbot_policy_setting.set_resource_approved_regions_policies["gcp-dataproc-job"]: Creation complete after 5s [id=216723260709806]
turbot_policy_setting.set_resource_approved_regions_policies["gcp-computeengine-region-disk"]: Creation complete after 5s [id=216723260658598]
turbot_policy_setting.set_resource_approved_regions_policies["gcp-composer-environment"]: Creating...
turbot_policy_setting.set_resource_approved_regions_policies["gcp-kubernetesengine-region-cluster"]: Creating...
turbot_policy_setting.set_resource_approved_regions_policies["gcp-network-target-pool"]: Creation complete after 6s [id=216723261220801]
turbot_policy_setting.set_resource_approved_regions_policies["gcp-kubernetesengine-zone-node-pool"]: Creation complete after 6s [id=216723261137849]
turbot_policy_setting.set_resource_approved_regions_policies["gcp-dataflow-job"]: Creating...
turbot_policy_setting.set_resource_approved_regions_policies["gcp-network-vpn-tunnel"]: Creation complete after 6s [id=216723261137850]
turbot_policy_setting.set_resource_approved_regions_policies["gcp-network-address"]: Creation complete after 6s [id=216723261293509]
turbot_policy_setting.set_resource_approved_regions_policies["gcp-dataproc-workflowtemplate"]: Creation complete after 6s [id=216723261092789]
turbot_policy_setting.set_resource_approved_regions_policies["gcp-kubernetesengine-region-node-pool"]: Creating...
turbot_policy_setting.set_resource_approved_regions_policies["gcp-computeengine-disk"]: Creating...
turbot_policy_setting.set_resource_approved_regions_policies["gcp-sql-instance"]: Creating...
turbot_policy_setting.set_resource_approved_regions_policies["gcp-bigtable-cluster"]: Creating...
turbot_policy_setting.set_resource_approved_regions_policies["gcp-kubernetesengine-region-cluster"]: Creation complete after 3s [id=216723264665550]
turbot_policy_setting.set_resource_approved_regions_policies["gcp-kms-cryptokey"]: Creating...
turbot_policy_setting.set_resource_approved_regions_policies["gcp-computeengine-disk"]: Creation complete after 3s [id=216723265934311]
turbot_policy_setting.set_resource_approved_regions_policies["gcp-kubernetesengine-region-node-pool"]: Creation complete after 3s [id=216723265932261]
turbot_policy_setting.gcp_project_approved_regions: Creating...
turbot_policy_setting.set_resource_approved_regions_policies["gcp-dataproc-cluster"]: Creating...
turbot_policy_setting.set_resource_approved_regions_policies["gcp-scheduler-job"]: Creation complete after 4s [id=216723264664525]
turbot_policy_setting.set_resource_approved_regions_policies["gcp-composer-environment"]: Creation complete after 4s [id=216723264674773]
turbot_policy_setting.set_resource_approved_regions_policies["gcp-dataflow-job"]: Creation complete after 3s [id=216723265947628]
turbot_policy_setting.set_resource_approved_regions_policies["gcp-sql-database"]: Creating...
turbot_policy_setting.set_resource_approved_regions_policies["gcp-functions-function"]: Creating...
turbot_policy_setting.set_resource_approved_regions_policies["gcp-computeengine-node-template"]: Creating...
turbot_policy_setting.set_resource_approved_regions_policies["gcp-network-router"]: Creation complete after 5s [id=216723266815985]
turbot_policy_setting.set_resource_approved_regions_policies["gcp-network-subnetwork"]: Creating...
turbot_policy_setting.set_resource_approved_regions_policies["gcp-bigtable-cluster"]: Creation complete after 4s [id=216723266883579]
turbot_policy_setting.set_resource_approved_regions_policies["gcp-computeengine-region-health-check"]: Creation complete after 5s [id=216723266848759]
turbot_policy_setting.set_resource_approved_regions_policies["gcp-sql-instance"]: Creation complete after 4s [id=216723266885629]
turbot_policy_setting.set_resource_approved_regions_policies["gcp-network-region-backend-service"]: Creating...
turbot_policy_setting.set_resource_approved_regions_policies["gcp-network-target-vpn-gateway"]: Creating...
turbot_policy_setting.set_resource_approved_regions_policies["gcp-kubernetesengine-zone-cluster"]: Creating...
turbot_policy_setting.set_resource_approved_regions_policies["gcp-kms-cryptokey"]: Creation complete after 3s [id=216723268055045]
turbot_policy_setting.set_resource_approved_regions_policies["gcp-dataproc-cluster"]: Creation complete after 3s [id=216723268061192]
turbot_policy_setting.set_resource_approved_regions_policies["gcp-network-region-url-map"]: Creating...
turbot_policy_setting.set_resource_approved_regions_policies["gcp-sql-backup"]: Creating...
turbot_policy_setting.set_resource_approved_regions_policies["gcp-sql-database"]: Creation complete after 5s [id=216723269333007]
turbot_policy_setting.set_resource_approved_regions_policies["gcp-computeengine-node-template"]: Creation complete after 5s [id=216723269429272]
turbot_policy_setting.gcp_project_approved_regions: Creation complete after 5s [id=216723269426197]
turbot_policy_setting.set_resource_approved_regions_policies["gcp-functions-function"]: Creation complete after 5s [id=216723269447709]
turbot_policy_setting.set_resource_approved_regions_policies["gcp-computeengine-instance"]: Creating...
turbot_policy_setting.set_resource_approved_regions_policies["gcp-storage-bucket"]: Creating...
turbot_policy_setting.set_resource_approved_regions_policies["gcp-network-subnetwork"]: Creation complete after 5s [id=216723271480377]
turbot_policy_setting.set_resource_approved_regions_policies["gcp-kubernetesengine-zone-cluster"]: Creation complete after 4s [id=216723271469105]
turbot_policy_setting.set_resource_approved_regions_policies["gcp-sql-backup"]: Creation complete after 4s [id=216723272673342]
turbot_policy_setting.set_resource_approved_regions_policies["gcp-network-target-vpn-gateway"]: Creation complete after 5s [id=216723271137318]
turbot_policy_setting.set_resource_approved_regions_policies["gcp-network-region-backend-service"]: Creation complete after 5s [id=216723271470130]
turbot_policy_setting.set_resource_approved_regions_policies["gcp-network-region-url-map"]: Creation complete after 4s [id=216723273735242]
turbot_policy_setting.set_resource_approved_regions_policies["gcp-computeengine-instance"]: Creation complete after 3s [id=216723273745486]
turbot_policy_setting.set_resource_approved_regions_policies["gcp-storage-bucket"]: Creation complete after 3s [id=216723274089557]

Apply complete! Resources: 35 added, 0 changed, 0 destroyed.

Outputs:

resource_approved_regions = {
  "gcp-bigtable-cluster" = "Check: Approved"
  "gcp-composer-environment" = "Check: Approved"
  "gcp-computeengine-disk" = "Check: Approved"
  "gcp-computeengine-instance" = "Check: Approved"
  "gcp-computeengine-node-group" = "Check: Approved"
  "gcp-computeengine-node-template" = "Check: Approved"
  "gcp-computeengine-region-disk" = "Check: Approved"
  "gcp-computeengine-region-health-check" = "Check: Approved"
  "gcp-dataflow-job" = "Check: Approved"
  "gcp-dataproc-cluster" = "Check: Approved"
  "gcp-dataproc-job" = "Check: Approved"
  "gcp-dataproc-workflowtemplate" = "Check: Approved"
  "gcp-functions-function" = "Check: Approved"
  "gcp-kms-cryptokey" = "Check: Approved"
  "gcp-kubernetesengine-region-cluster" = "Check: Approved"
  "gcp-kubernetesengine-region-node-pool" = "Check: Approved"
  "gcp-kubernetesengine-zone-cluster" = "Check: Approved"
  "gcp-kubernetesengine-zone-node-pool" = "Check: Approved"
  "gcp-network-address" = "Check: Approved"
  "gcp-network-forwarding-rule" = "Check: Approved"
  "gcp-network-region-backend-service" = "Check: Approved"
  "gcp-network-region-url-map" = "Check: Approved"
  "gcp-network-router" = "Check: Approved"
  "gcp-network-subnetwork" = "Check: Approved"
  "gcp-network-target-pool" = "Check: Approved"
  "gcp-network-target-vpn-gateway" = "Check: Approved"
  "gcp-network-vpn-tunnel" = "Check: Approved"
  "gcp-scheduler-job" = "Check: Approved"
  "gcp-spanner-instance" = "Check: Approved"
  "gcp-sql-backup" = "Check: Approved"
  "gcp-sql-database" = "Check: Approved"
  "gcp-sql-instance" = "Check: Approved"
  "gcp-storage-bucket" = "Check: Approved"
}
smart_folder_description = Defines sets of policies for the GCP Check Regions baseline
smart_folder_name = GCP Check Regions Policies
smart_folder_parent_resource = tmod:@turbot/turbot#/
turbot_profile = punisher